package com.bluetoastquest.questrepository

import com.bluetoastquest.R
import com.bluetoastquest.questlist.QuestData
import com.bluetoastquest.questlist.QuestTask

val historyQuest = QuestData(
    "HistoryQuest",
    "Історичний квест",
    R.drawable.history_quest,
    "Шевченкіський гай",
    "Привіт! Запрошуємо Вас у незвичайну мандрівку часом, де Ви направду опинитесь посеред шевченківських рядків “Садок вишневий коло хати, хрущі над вишнями гудуть…”. Сьогодні ви зможете не тільки насолодитись неймовірним українським колоритом, а й провести час з користю ! За проходження Історичного квесту Ви зможете отримати знижку на відвідування музею зброї \" Арсенал\" - 10%",
    "Ура! Ви успішно пройшли Історичний квест та отримуєте 10% знижки на відвідування музею зброї \"Арсенал\" ( при покупці квитків на касі вкажіть промокод \"  GRINKA\" та скористайтесь своєю знижкою ) \n" +
            "До наступної зустрічі!",
    listOf(
        QuestTask(
            1,
            "Знайдіть хатинку Гончара ( с. Потелич, Львівщина ) та проскануйте QR-код схований у середені",
            R.drawable.history_quest_step_1,
            "History_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Ви знайшли першу локацію! Далі прямуйте до старовинної школи  (С. БУСОВИСЬКО СТАРОСАМБІРСЬКОГО РАЙОНУ). Там ви знайдете наступну підказку у вигляді другого QR-коду",
            R.drawable.history_quest_step_2,
            "History_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Ви вже на півдорозі до перемоги! Відправляйтеся до Ґрадже ( с. КРИВОРІВНЯ ВЕРХОВИНСЬКОГО РАЙОНУ ІВАНО-ФРАНКІВСЬКОЇ ОБЛАСТІ) та шукайте свій наступний QR-код",
            R.drawable.history_quest_step_3,
            "History_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "До перемоги залишився 1 крок! Вам потрібно знайти шестикрилий вітряк ( С. ШИРІВЦІ ХОТИНСЬКОГО РАЙОНУ ЧЕРНІВЕЦЬКОЇ ОБЛАСТІ ) та відсканувати останній QR-код!",
            R.drawable.history_quest_step_4,
            "History_Quest_Step_4_Password"
        )
    )
)

val forestQuest = QuestData(
    "ForestQuest",
    "Лісовий квест",
    R.drawable.forest_quest_image,
    "Парк Костюшка",
    "Привіт, це - лісовий квест! Сьогодні на Вас чекають багато яскравих емоцій та веселощів! За проходження квесту Ви зможете отримати знижку в STEM школі Inventor на пробне заняття (-50%)",
    " Ура! Ви успішно пройшли Лісовий  квест та  отримуєте знижку в STEM школі Inventor на пробне заняття -50%\n" +
            " ( при записі на заняття за телефоном +38 (093) 170 74 50 вкажіть промокод \"  GRINKA\" та скористайтесь своєю знижкою ) ",
    listOf(
        QuestTask(
            1,
            "Знайдіть Майданчик Весела корівка ,а саме бочку на ній знайдеш QR- код , він підкаже куди рухатись далі ",
            R.drawable.forest_quest_step_1,
            "Forest_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Ви знайшли першу локацію! Далі прямуйте до місця де гуляють лише 4-лапі і на дошці оголошень знайдете наступний QR- код ",
            R.drawable.forest_quest_step_2,
            "Forest_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Ви вже на півдорозі до перемоги! Відправляйтеся вгору до Дністра, і вище поки не знайдете на проти церкви Юра , місцину де можна гарно полазити, і на верхівці найвищого замку відскануй наступний код...",
            R.drawable.forest_quest_step_3,
            "Forest_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "До перемоги залишився 1 крок! Вам потрібно знайти Львівський цирк, і на майданчику поруч, в голові Слона ти знайдеш нову піказку...",
            R.drawable.forest_quest_step_4,
            "Forest_Quest_Step_4_Password"
        )
    )
)

val horrorQuest = QuestData(
    "HorrorQuest",
    "Horror квест",
    R.drawable.horror_quest_image,
    "Личаківське кладовище",
    "Привіт! Сьогодні Вас чекає незвичайна пригода, що відбувається на території одного з найстаріших кладовищ Східної Європи! Вам знадобиться чимало відваги та сміливості! За проходження квесту Ви зможете отримати знижку на відвідування кімнати страху «Insomnia» - 10%",
    " Ви справді дуже відважні! Щойно ви самотужки познайомилися з Личаківським некрополем. Якщо ви полоскотали собі нерви – саме час заспокоїтися та озирнутися. Тут спочилої чимало людей, перетворивши це місце в музей під відкритим небом. Ваш приз тут - отримуєте 10% знижки на відвідування кімнати страху «Insomnia» ( при покупці квитків на касі вкажіть промокод \"  GRINKA\" та скористайтесь своєю знижкою ) \n" +
            "До наступної зустрічі!",
    listOf(
        QuestTask(
            1,
            "Свою подорож Ви розпочнете з центрального входу на Личаківське кладовище. Шукайте свій перший QR-код на інфо-дошці, яку знайдете біля воріт.",
            R.drawable.horror_quest_step_1,
            "Horror_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Ви знайшли перший вказівник! Далі Вас чекає захплююча подорож через усе кладовище, під час якої ви зможете відчути всю містичну атмосферу цього місця та отримати порцію адреналіну. Наступну і останню свою підказку ви знайдете на інфодошці біля Меморіалу львівських орлят! Будьте обачні та оглядайтеся навкруги!",
            R.drawable.horror_quest_step_2,
            "Horror_Quest_Step_2_Password"
        )
    )
)

val altitudeQuest = QuestData(
    "AltitudeQuest",
    "Квест «На Висоті»",
    R.drawable.altitude_quest_image,
    "Центр міста",
    "Привіт! Сьогодні на Вас чекає захоплююча подорож прогулянка найвищими вершинами Львова. Вам знадобиться багато енергії і наснаги. За проходження квесту Ви зможете отримати знижку на враження « Стрибок з Парашутом» від KAVA- 5%",
    "Ура! Ви успішно пройшли квест « На висоті»  та отримуєте 5% на враження « Стрибок з Парашутом» від KAVA ( при покупці вкажіть промокод \"  GRINKA\" та скористайтесь своєю знижкою ) \n" +
            "До наступної зустрічі!",
    listOf(
        QuestTask(
            1,
            "Перша вершина яку Вам треба підкорити – Лиса Гора. Знаєте, чому вона «лиса»? Кажуть, давним давно тут збиралася вся Львівська нечисть на шабаш! Будьте обережні! На верхівці ви знайдете QR-код який вкаже вам подальший шлях",
            R.drawable.altitude_quest_step_1,
            "Altitude_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Ви знайшли першу локацію! Далі прямуйте до Високого замку за наступною підказкою. Звідси відкривається чудова панорама на місто. Якщо блукаєте не самі – прихопіть з собою маленький замочок, щоб залишити його на огорожі на згадку.",
            R.drawable.altitude_quest_step_2,
            "Altitude_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "До перемоги залишилось зовсім трішки! Далі Вам потрібно піднятись на оглядовий майданчик Львівської ратуші та відсканувати останній QR! Насолоджуйтесь прогулянкою! Ви маєте можливість побачити найбільший львівський годинник!",
            R.drawable.altitude_quest_step_3,
            "Altitude_Quest_Step_3_Password"
        )
    )
)

val memoQuest = QuestData(
    "MemoQuest",
    "Мемо-квест",
    R.drawable.memo_quest_image,
    "ТЦ « Південний»",
    "Привіт! Сьогодні Ви зможете відкрити для себе по-новому вже знайомі для Вас локації. Вирушайте в цікаву подорож по ТЦ «Південний»",
    "Ура! Ви успішно пройшли квест та отримуєте знижку в STEM школі Inventor на пробне заняття (-50%) \n" +
            "До наступної зустрічі!",
    listOf(
        QuestTask(
            1,
            "Отож, ви на території ТРК «ПІВДЕННИЙ»! Якщо ви місцевий – то знаєте, що тут є все! Без винятку! Пройдіть до Сільпо і знайдіть свій перший QR-код. Він захований ззовні!",
            R.drawable.memo_quest_step_1,
            "Memo_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            " Вітаю! Ви знайшли першу локацію! Далі прямуйте до магазину « Скринька рукодільних чудес». Складно? О так! Пам’ятай, що чуйні охоронці завжди допоможуть! Там ви знайдете наступну підказку у вигляді другого QR-коду.",
            R.drawable.memo_quest_step_2,
            "Memo_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Ви вже на півдорозі до перемоги! Вже помітили футбольне поле на даху? Відправляйтеся до магазину «Еко-косметика» та шукайте свій наступний QR-код.",
            R.drawable.memo_quest_step_3,
            "Memo_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "Ще не заблукали? Та Ви генії орієнтування на «ПІВДЕННОМУ»! До перемоги залишився 1 крок! Вам потрібно знайти магазин « Рандеву» та відсканувати останній QR-код!",
            R.drawable.memo_quest_step_4,
            "Memo_Quest_Step_4_Password"
        )
    )
)

val hedgehogQuest = QuestData(
    "HedgehogQuest",
    "Їжак Парк квест",
    R.drawable.hedgehog_quest_image,
    "Їжак Парк",
    "Привіт, дорогі друзі! Вітаємо вас в найбільшому тюбінг парку України – Їжак Парк. Пропоную вам провести свій час весело, активно та пізнавально. Виконайте завдання з квесту, дізнайся багато цікавих фактів про їжачків та отримайте подарунок. ",
    "Ура! Ви успішно пройшли  квест  Їжак Парку та  отримуєте знижку на катання на тюбах В Їжак Парку. \n" +
            " ( щоб скористатися знижкою попередньо зателефонуйте за телефоном 0671755237  вкажіть промокод «Я люблю Їжак Парк\"\" та скористайтесь своєю знижкою )\n" +
            "*щоб отримати знижку – покажіть людинці на касі останню сторінку квесту!",
    listOf(
        QuestTask(
            1,
            "Квест розпочато! Рухайтесь до дерев’яного вказівника «Вас Вітає Їжак Парк» на ньому ви знайдете  QR-код, він підкаже куди йти далі.\n" +
                    "Цікавий факт: «Їжаки зꞌявилися на Землі орієнтовно 15 міліонів років назад і у світі існує близько 17 їх видів.",
            R.drawable.hedgehog_quest_step_1,
            "Hedgehog_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Ви знайшли першу локацію! Далі розпочинається знайомство з комплексом Їжак Парк. Прямуйте до кошари , де мешкають наші барашки. Там на інформаційній дошці знайдете наступний QR-код. \nЦікавий факт: «Їжачки впадають у зимову спячку на 128 днів»",
            R.drawable.hedgehog_quest_step_2,
            "Hedgehog_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Ви вже на півдорозі до перемоги! Наступна зупинка озеро, в якому мешкає форель. Щоб туди дістатись треба рухатись в сторону парковки. Там на тебе чекає наступний QR-код»\n" +
                    "Цікавий факт: «Кількість голок на тілі їжака - 7-10 тисяч, причому голки оновлюються - старі випадають, а нові відростають»",
            R.drawable.hedgehog_quest_step_3,
            "Hedgehog_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "До перемоги ще трішки! Щоб знайти наступну локацію треба відгадати загадку: \n" +
                    "«Птах цей довгі ноги має,\n" +
                    "Голову в пісок ховає,\n" +
                    "Хоч і швидко він біжить —\n" +
                    "В небеса не полетить!»\n" +
                    "Цікавий факт: «Їжаки можуть бігти зі швидкість до 3 м/с, вони добре плавають і стрибають.»",
            R.drawable.hedgehog_quest_step_4,
            "Hedgehog_Quest_Step_4_Password"
        ),
        QuestTask(
            4,
            "«Залишився один крок! Останній QR-код знаходиться там де можна \n" +
                    "починається драйв і шалені емоції, де багато надувних ватрушок, що дарують швидкісні спуски»\n" +
                    "Цікавий факт: «За добу їжак долає відстань в 2 км»",
            R.drawable.hedgehog_quest_step_5,
            "Hedgehog_Quest_Step_5_Password"
        )
    )
)

val zooQuest = QuestData(
    "ZooQuest",
    "Zoo квест",
    R.drawable.zoo_quest_image,
    "Київський зоопарк",
    "Привіт!!!\n" +
            "Ти завітав на Zoo-квест. Сьогодні тебе чекає неперевершена подорож по\n" +
            "зоопарку, де ти зустрінеш багато звірят, та весело проведеш цей день!!!",
    "Вітаю!!! Ви успішно пройшли zoo-квест! Ваш приз – безкоштовна\n" +
            "кава на вибір при замовленні львівської випічки!\n" +
            "Забрати смачний гостинець ви зможете за адресою: Хмельницього 10, або ж\n" +
            "Спаська 5 в мережі «Львівські пляцки»!»",
    listOf(
        QuestTask(
            1,
            "Гуляючи по зоопарку знайдіть\n" +
                    "Черепашку та проскануйте перший QR код",
            R.drawable.zoo_quest_step_1,
            "Zoo_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Ви знайшли першу підказку\n" +
                    "Прямуйте до вольєру з мавпочками і скануйте QR код",
            R.drawable.zoo_quest_step_2,
            "Zoo_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Ви вже на півдорозі до перемоги!\n" +
                    "Тепер Вам потрібно завітати до єнотика і відсканувати QR код",
            R.drawable.zoo_quest_step_3,
            "Zoo_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "Ви вже майже дійшли до перемоги - прямуйте до озера з лебедями\n" +
                    "і скануйте QR код",
            R.drawable.zoo_quest_step_4,
            "Zoo_Quest_Step_4_Password"
        ),
        QuestTask(
            5,
            "До перемоги залишився останній крок! Прямуйте до вольєру з білою\n" +
                    "совою та скануйте QR код",
            R.drawable.zoo_quest_step_5,
            "Zoo_Quest_Step_5_Password"
        )
    )
)

val flowersQuest = QuestData(
    "FlowersQuest",
    "Квітковий квест",
    R.drawable.flowers_quest_image,
    "Співоче поле",
    "Привіт, друже! Сьогодні ти потрапиш у цікаву подорож.",
    "Вітаємо! Ти пройшов квітковий квест. Ваш чарівний приз - знижка на\n" +
            "солодкий штрудель 20%\n" +
            "Забрати смачний та корисний гостинець ви зможете за адресою Хмельницього\n" +
            "10, або ж Спаська 5 в мережі «Львівські пляцки»!",
    listOf(
        QuestTask(
            1,
            "Для того щоб +" +
                    "почати квест потрібно підійти до сцени на співочому полі та знайти перший " +
                    "QR-код",
            R.drawable.flowers_quest_step_1,
            "Flowers_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Ого, а ти крутелик! Тепер рухайся до велосипеду, та шукай свій наступний QR\n" +
                    "код в квітах",
            R.drawable.flowers_quest_step_2,
            "Flowers_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Супер! Тепер шукай мініатюру Лондона. Знайшов? Навпроти нього твій\n" +
                    "наступний QR-код",
            R.drawable.flowers_quest_step_3,
            "Flowers_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "Ти вже майже закінчив! Останній код заховався біля гігантських окулярів",
            R.drawable.flowers_quest_step_4,
            "Flowers_Quest_Step_4_Password"
        )
    )
)

// removed
//val bikeQuest = QuestData(
//    "BikeQuest",
//    "Вело квест",
//    R.drawable.bike_quest_image,
//    "парк Івана Франка",
//    "Привіт! Ти попав на Вело квест\n" +
//            "Сьогодні на тебе чекає цікава подорож!",
//    "Супер! Ваш приз – безкоштовна кава на вибір при замовленні\n" +
//            "львівської випічки!\n" +
//            "Забрати смачний гостинець ви зможете за адресою: Хмельницього 10, або ж\n" +
//            "Спаська 5 в мережі «Львівські пляцки»!»",
//    listOf(
//        QuestTask(
//            1,
//            "Шукай площадку навпроти входу та відскануй QR-код. Він підкаже,\n" +
//                    "дорогу. ",
//            R.drawable.bike_quest_step_1,
//            "Bike_Quest_Step_1_Password"
//        ),
//        QuestTask(
//            2,
//            "Вітаю! Ви знайшли першу локацію. Тепер " +
//                    "прямуйте до фонтану. Там ви знайдете наступний QR-код",
//            R.drawable.bike_quest_step_2,
//            "Bike_Quest_Step_2_Password"
//        ),
//        QuestTask(
//            3,
//            "«Ура! Ви вже на півшляху до перемоги! Шукайте Івана Франка\n" +
//                    "та скануйте наступний QR-код",
//            R.drawable.bike_quest_step_3,
//            "Bike_Quest_Step_3_Password"
//        ),
//        QuestTask(
//            4,
//            "«Залишилось зовсім трішки! Прямуйте до альтанки і скануйте QR-код",
//            R.drawable.bike_quest_step_4,
//            "Bike_Quest_Step_4_Password"
//        )
//    )
//)

val romanticQuest = QuestData(
    "Quest",
    "Романтичний квест",
    R.drawable.romantic_quest_image,
    "Парк культури",
    "Привіт! Ви потрапили на Романтичний квест\n" +
            "Сьогодні на Вас чекає багато цікавого і нового.",
    "Ура!!! Ви пройшли цей квест!\n" +
            "Ваш чарівний приз - міні фігурка LEGO від INVENTOR при купівлі першого абонементу",
    listOf(
        QuestTask(
            1,
            "Вирушайте на пошуки лазанки, де захований перший\n" +
                    "QR код. Прямуйте прямо від входу, майже до самого низу.",
            R.drawable.romantic_quest_step_1,
            "Romantic_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю!!! Ви знайшли першу підказку! Тепер шукайте сцену та наступний QR-код",
            R.drawable.romantic_quest_step_2,
            "Romantic_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "«Ви вже на півдорозі до перемоги! Наступна зупинка - колесо огляду, де ми заховали ще один QR-код",
            R.drawable.romantic_quest_step_3,
            "Romantic_Quest_Step_3_Password"
        )
    )
)

val grinkaQuest = QuestData(
    "GrinkaQuest",
    "Grinka квест",
    R.drawable.grinka_quest_image,
    "ВДНГ",
    "Привіт! Ти завітав на квест по ВДНГ сьогодні ти побачиш багато\n" +
            "цікавого!Тож успіху тобі!",
    "Ура! Ти успішно пройшов квест на ВДНГ. Прямуй до піт-зони 23,\n" +
            "щоб отримати приз !!!",
    listOf(
        QuestTask(
            1,
            "Шукай зону STEM-школи INVENTOR та скануй свій перший QR код",
            R.drawable.grinka_quest_step_1,
            "Grinka_Quest_Step_1_Password"
        ),
        QuestTask(
            2,
            "Вітаю! Першу підказку знайдено! Тепер прямуй до зони Robo-art і\n" +
                    "скануй QR код",
            R.drawable.grinka_quest_step_2,
            "Grinka_Quest_Step_2_Password"
        ),
        QuestTask(
            3,
            "Ти вже на півдорозі до перемоги! Прямуй до фотозони і шукай\n" +
                    "наступний QR код",
            R.drawable.grinka_quest_step_3,
            "Grinka_Quest_Step_3_Password"
        ),
        QuestTask(
            4,
            "Оце ти крутелик! Ти вже майже закінчив! Прямуй до зони настільних\n" +
                    "ігор і скануй QR код",
            R.drawable.grinka_quest_step_4,
            "Grinka_Quest_Step_3_Password" // not mistake, just lazy
        ),
        QuestTask(
            5,
            "Залишився останній крок! Шукай LEGO-карту України\n" +
                    "Та скануй QR код",
            R.drawable.grinka_quest_step_5,
            "Grinka_Quest_Step_5_Password"
        )
    )
)
